# BendAngleIsUnacceptable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BendFailures..::..BendAngleIsUnacceptable Property
BuiltInFailures..::..BendFailures Class See Also
---
The angle of the bend/elbow is unacceptable
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BendAngleIsUnacceptable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendAngleIsUnacceptable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BendAngleIsUnacceptable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BendFailures Class
Autodesk.Revit.DB Namespace